        PROC 0
        CONTROL LIST
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.COMPILER') +
        RELATE('NCAMCM.PASS.REL32V0.COMPILER'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.ERRORLIB') +
        RELATE('NCAMCM.PASS.REL32V0.ERRORLIB'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.MONITOR.LOAD') +
        RELATE('NCAMCM.PASS.REL32V0.MONITOR.LOAD'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.RUNOBJ') +
        RELATE('NCAMCM.PASS.REL32V0.RUNOBJ'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.RUNLIB') +
        RELATE('NCAMCM.PASS.REL32V0.RUNLIB'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.RUNLST') +
        RELATE('NCAMCM.PASS.REL32V0.RUNLST'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.SDFPKGC.OBJ') +
        RELATE('NCAMCM.PASS.REL32V0.SDFPKGC.OBJ'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.ZCONOBJ') +
        RELATE('NCAMCM.PASS.REL32V0.ZCONOBJ'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.AUX.PROCS') +
        RELATE('NCAMCM.PASS.REL32V0.AUX.PROCS'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.FLO.PROCS') +
        RELATE('NCAMCM.PASS.REL32V0.FLO.PROCS'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.OPT.PROCS') +
        RELATE('NCAMCM.PASS.REL32V0.OPT.PROCS'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.PASS1.PROCS') +
        RELATE('NCAMCM.PASS.REL32V0.PASS1.PROCS'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.PASS2.PROCS') +
        RELATE('NCAMCM.PASS.REL32V0.PASS2.PROCS'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.PASS3.PROCS') +
        RELATE('NCAMCM.PASS.REL32V0.PASS3.PROCS'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.PASS4.PROCS') +
        RELATE('NCAMCM.PASS.REL32V0.PASS4.PROCS'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.HALINCL') +
        RELATE('NCAMCM.PASS.REL32V0.HALINCL'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.MONITOR.ASM') +
        RELATE('NCAMCM.PASS.REL32V0.MONITOR.ASM'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.RUNASM') +
        RELATE('NCAMCM.PASS.REL32V0.RUNASM'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.RUNMAC') +
        RELATE('NCAMCM.PASS.REL32V0.RUNMAC'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.SDFPKG.ASM') +
        RELATE('NCAMCM.PASS.REL32V0.SDFPKG.ASM'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.SDFPKGC') +
        RELATE('NCAMCM.PASS.REL32V0.SDFPKGC'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.SDFPKGC.H') +
        RELATE('NCAMCM.PASS.REL32V0.SDFPKGC.H'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.ZCONASM') +
        RELATE('NCAMCM.PASS.REL32V0.ZCONASM'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.DIAGNSTC.MACLIB') +
        RELATE('NCAMCM.PASS.REL32V0.DIAGNSTC.MACLIB'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.BUILD.CLIST') +
        RELATE('NCAMCM.PASS.REL32V0.BUILD.CLIST'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.CM.CLIST') +
        RELATE('NCAMCM.PASS.REL32V0.CM.CLIST'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.CM.JCL') +
        RELATE('NCAMCM.PASS.REL32V0.CM.JCL')
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.TEST.CLIST') +
        RELATE('NCAMCM.PASS.REL32V0.TEST.CLIST'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.AUX.OBJ') +
        RELATE('NCAMCM.PASS.REL32V0.AUX.OBJ'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.FLO.OBJ') +
        RELATE('NCAMCM.PASS.REL32V0.FLO.OBJ'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.OPT.OBJ') +
        RELATE('NCAMCM.PASS.REL32V0.OPT.OBJ'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.PASS1.OBJ') +
        RELATE('NCAMCM.PASS.REL32V0.PASS1.OBJ'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.PASS2.OBJ') +
        RELATE('NCAMCM.PASS.REL32V0.PASS2.OBJ'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.PASS3.OBJ') +
        RELATE('NCAMCM.PASS.REL32V0.PASS3.OBJ'))
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.PASS4.OBJ') +
        RELATE('NCAMCM.PASS.REL32V0.PASS4.OBJ'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.COMPILER') +
        RELATE('NCAMCM.BFS.REL17V0.COMPILER'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.ERRORLIB') +
        RELATE('NCAMCM.BFS.REL17V0.ERRORLIB'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.MONITOR.LOAD') +
        RELATE('NCAMCM.BFS.REL17V0.MONITOR.LOAD'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.RUNOBJ') +
        RELATE('NCAMCM.BFS.REL17V0.RUNOBJ'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.RUNLIB') +
        RELATE('NCAMCM.BFS.REL17V0.RUNLIB'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.RUNLST') +
        RELATE('NCAMCM.BFS.REL17V0.RUNLST'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.QCONLIB') +
        RELATE('NCAMCM.BFS.REL17V0.QCONLIB'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.SDFPKGC.OBJ') +
        RELATE('NCAMCM.BFS.REL17V0.SDFPKGC.OBJ'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.AUX.PROCS') +
        RELATE('NCAMCM.BFS.REL17V0.AUX.PROCS'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.FLO.PROCS') +
        RELATE('NCAMCM.BFS.REL17V0.FLO.PROCS'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.OPT.PROCS') +
        RELATE('NCAMCM.BFS.REL17V0.OPT.PROCS'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.PASS1.PROCS') +
        RELATE('NCAMCM.BFS.REL17V0.PASS1.PROCS'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.PASS2.PROCS') +
        RELATE('NCAMCM.BFS.REL17V0.PASS2.PROCS'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.PASS3.PROCS') +
        RELATE('NCAMCM.BFS.REL17V0.PASS3.PROCS'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.PASS4.PROCS') +
        RELATE('NCAMCM.BFS.REL17V0.PASS4.PROCS'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.HALINCL') +
        RELATE('NCAMCM.BFS.REL17V0.HALINCL'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.MONITOR.ASM') +
        RELATE('NCAMCM.BFS.REL17V0.MONITOR.ASM'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.RUNASM') +
        RELATE('NCAMCM.BFS.REL17V0.RUNASM'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.SATSLST') +
        RELATE('NCAMCM.BFS.REL17V0.SATSLST'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.RUNMAC') +
        RELATE('NCAMCM.BFS.REL17V0.RUNMAC'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.SDFASM') +
        RELATE('NCAMCM.BFS.REL17V0.SDFASM'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.SDFPKG.ASM') +
        RELATE('NCAMCM.BFS.REL17V0.SDFPKG.ASM'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.SDFPKGC') +
        RELATE('NCAMCM.BFS.REL17V0.SDFPKGC'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.SDFPKGC.H') +
        RELATE('NCAMCM.BFS.REL17V0.SDFPKGC.H'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.DIAGNSTC.MACLIB') +
        RELATE('NCAMCM.BFS.REL17V0.DIAGNSTC.MACLIB'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.BUILD.CLIST') +
        RELATE('NCAMCM.BFS.REL17V0.BUILD.CLIST'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.CM.CLIST') +
        RELATE('NCAMCM.BFS.REL17V0.CM.CLIST'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.CM.JCL') +
        RELATE('NCAMCM.BFS.REL17V0.CM.JCL'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.TEST.CLIST') +
        RELATE('NCAMCM.BFS.REL17V0.TEST.CLIST'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.TEST.JCL') +
        RELATE('NCAMCM.BFS.REL17V0.TEST.JCL'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.AUX.OBJ') +
        RELATE('NCAMCM.BFS.REL17V0.AUX.OBJ'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.FLO.OBJ') +
        RELATE('NCAMCM.BFS.REL17V0.FLO.OBJ'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.OPT.OBJ') +
        RELATE('NCAMCM.BFS.REL17V0.OPT.OBJ'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.PASS1.OBJ') +
        RELATE('NCAMCM.BFS.REL17V0.PASS1.OBJ'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.PASS2.OBJ') +
        RELATE('NCAMCM.BFS.REL17V0.PASS2.OBJ'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.PASS3.OBJ') +
        RELATE('NCAMCM.BFS.REL17V0.PASS3.OBJ'))
        DEFINE ALIAS (NAME('NCAMCM.BFS.CURRENT.PASS4.OBJ') +
        RELATE('NCAMCM.BFS.REL17V0.PASS4.OBJ'))
