        PROC 0
        CONTROL LIST
        DEFINE ALIAS (NAME('NCAMCM.PASS.CURRENT.SDFPKGC.OBJ') +
        RELATE('NCAMCM.PASS.REL32V0.SDFPKGC.OBJ'))
 
