//DSSPCST JOB (CPAFDVV5,CWS1RR4,ASSEMBLE,OI30),'SCHULENBERG',
// TIME=(5,00),MSGCLASS=X,NOTIFY=DSSPCS,USER=DSSPCS,PASSWORD=????????
//*MAIN CLASS=REGBATCH
//*LINES=5000
//*FORMAT PR,DDNAME=COMPRINT,COPIES=1
//FORTCLG EXEC VSF2CLG,TIME=(5,00)
//FORT.SYSIN  DD DSN=DSSPCS.FORT.SRC(SDFTOOL),DISP=SHR
//FORT.SYSLIB DD DSN=DSSPCS.FORT.INC,DISP=SHR
//GO.FT07F001 DD DSN=DSSPCS.FORT.SDFTOOL.LST,DISP=SHR
//GO.FT10F001 DD UNIT=SYSDA,SPACE=(CYL,(200,50))
